#include<iostream>
#include<vector>

using namespace std;

//����һ������ n ������ 0 <= i <= n �е�ÿ�� i ������������Ʊ�ʾ�� 1 �ĸ��� ������һ������Ϊ n + 1 ������ ans ��Ϊ�𰸡�
//
// 
//
//ʾ�� 1��
//
//���룺n = 2
//�����[0,1,1]
//���ͣ�
//0 --> 0
//1 --> 1
//2 --> 10
//ʾ�� 2��
//
//���룺n = 5
//�����[0,1,1,2,1,2]
//���ͣ�
//0 --> 0
//1 --> 1
//2 --> 10
//3 --> 11
//4 --> 100
//5 --> 101
//
// 

class Solution {
public:
    vector<int> countBits(int n) {
        vector<int> table(n + 1); table[0] = 0;
        for (int j = 1; j <= n; j++)
        {
            table[j] = table[j >> 1] + (j & 1);
            // int num =0;
            // for(int i=0;i<32;i++)
            // {
            //     if(j&(1<<i))
            //     num++;
            // }
            // table[j]=num;
        }
        return table;

    }
};

int main()
{

    return 0;
}